# OwnerGroup Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinition..::..OwnerGroup Property
ExternalDefinition Class See Also
---
Returns or change the group ID of the external parameter definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual DefinitionGroup OwnerGroup { get; set; }
```

Visual Basic
---
```text
Public Overridable Property OwnerGroup As DefinitionGroup
	Get
	Set
```

Visual C++
---
```text
public:
virtual property DefinitionGroup^ OwnerGroup {
	DefinitionGroup^ get ();
	void set (DefinitionGroup^ value);
}
```

# Remarks
If failed When set the group, an InvalidOperationException will be thrown.
# See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace